# IGTI - Bootcamp - Cientista de Dados

## Desafio 2

Autor: Leonardo Simões

### Perguntas

    1) Quantas pessoas possuem idade maior ou igual a 50 anos?
    2) Qual a média de idade das pessoas que moram em Mato Grosso? 
    3) Quantas pessoas nasceram nos anos de 1968 a 1978 (incluindo 1968 e 1978)? 
    4) Ao executar o seguinte comando SQL no banco de dados criado, qual é o valor retornado?

        select count(*) from tb_pessoa inner join
        tb_tiposanguineo on tb_pessoa.id_tiposanguineo =
        tb_tiposanguineo.id inner join tb_cidade on
        tb_pessoa.id_cidade = tb_cidade.id inner join
        tb_estado on tb_cidade.id_estado = tb_estado.id where
        tb_tiposanguineo.tipo like "AB-" and (tb_estado.sigla
        like "AP" or tb_estado.sigla like "PE")

    5) Qual o nome da pessoa mais velha na base de dados? 
    6) Qual o nome da pessoa mais nova da base de dados? 
    7) Qual jogo possui a maior venda global (“Global_Sales”) para a plataforma PS2? 
    8) Qual a posição no Rank global (“Rank”) está o segundo jogo mais vendido na Europa? Ordenar pelo atributo "EU_Sales". 
    9) Qual o nome do jogo que possui a menor venda global (“Global_Sales”) no ano de 2010? 
    10) Qual a plataforma (“Platform”) do jogo mais vendido considerando as vendas globais ("Global_Sales ") no ano de 2008?
    11) Qual o nome do jogo que é exibido ao executar o comando para retornar o primeiro documento da coleção onde a condição seja a plataforma (“Platform”) igual a PS4? 
    12) Quantos documentos existem na base de dados referentes à plataforma (“Platform”) “X360”? 
    13) Qual a plataforma (“Platform”) do jogo mais vendido no Japão ("JP_Sales") no ano de 2015? 
    14) Em que posição do “Rank” o jogo “The Witcher 3: Wild Hunt” está considerando a plataforma “XOne”? 
    15) Quantos documentos são retornados ao executar uma consulta em que o atributo “Global_Sales” seja maior 
        ou igual a 2?

In [1]:
import numpy as np
import pandas as pd
import json

import requests
import os
from functools import reduce

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

# suppress warnings from final output
import warnings
warnings.simplefilter("ignore")

### Desenvolvimento - Parte 1

In [2]:
URL_API = 'https://api-coleta-dados.herokuapp.com/api/pessoas'

In [3]:
r = requests.get(URL_API)
data = r.text

In [4]:
json_data = json.loads(data)
df = pd.DataFrame(json_data)

In [5]:
df.head()

,nome,idade,data_nasc,sexo,signo,cidade,estado,altura,peso,tipo_sanguineo,cor
0,Silvana Hadassa,NaN,12/06/1964,Feminino,Gêmeos,Brasília,DF,"1,67",50,A+,vermelho
1,Thales Kaique,27.0,10/12/1993,Masculino,Sagitário,Campo Grande,MS,"1,63",110,B+,laranja
2,Henry Nathan,29.0,21/09/1991,Masculino,Virgem,Macapá,AP,"1,86",106,AB-,verde
3,Lorenzo Vinicius,64.0,22/10/1956,Masculino,Libra,Contagem,MG,"1,87",100,O+,vermelho
4,Cauã Henrique,50.0,09/03,Masculino,Peixes,Rondonópolis,MT,"1,74",83,O-,vermelho

    1) Quantas pessoas possuem idade maior ou igual a 50 anos?

In [6]:
df.query('idade >= 50').shape[0]

23

    2) Qual a média de idade das pessoas que moram em Mato Grosso?

In [7]:
df_mt = df.query('estado == "MT"')
df_mt.head()

,nome,idade,data_nasc,sexo,signo,cidade,estado,altura,peso,tipo_sanguineo,cor
4,Cauã Henrique,50.0,09/03,Masculino,Peixes,Rondonópolis,MT,"1,74",83,O-,vermelho
15,Benício Guilherme,37.0,09/02/1983,Masculino,Aquário,Rondonópolis,MT,"1,63",95,O-,laranja
31,Danilo Jorge,38.0,25/08/1982,Masculino,Virgem,Rondonópolis,MT,"1,79",87,AB+,preto
36,Henry Elias,57.0,26/04/1963,Masculino,Touro,Várzea Grande,MT,"1,83",103,AB+,vermelho
43,Osvaldo Augusto,41.0,15/04/1979,Masculino,Áries,Cuiabá,MT,"1,79",107,A-,preto

In [8]:
df_mt['idade'].mean()

44.6

    3) Quantas pessoas nasceram nos anos de 1968 a 1978 (incluindo 1968 e 1978)?

In [9]:
df_data_incompleta = df.query('data_nasc.str.len() != "10"')
df_data_incompleta

,nome,idade,data_nasc,sexo,signo,cidade,estado,altura,peso,tipo_sanguineo,cor
4,Cauã Henrique,50.0,09/03,Masculino,Peixes,Rondonópolis,MT,"1,74",83,O-,vermelho
14,Daniel Lucca,21.0,22/01,Masculino,Aquário,Planaltina,GO,"1,84",105,A+,verde
18,Antonio Sérgio,49.0,15/04,Masculino,Áries,Carpina,PE,"1,65",71,O+,azul
27,Rafael Ryan,70.0,10/01,Masculino,Capricórnio,Arapiraca,AL,"1,98",85,O-,laranja
30,Martin Edson,35.0,15/01,Masculino,Capricórnio,Aracaju,SE,"1,60",59,A-,laranja
34,Bruno Manuel,57.0,14/09,Masculino,Virgem,Jataí,GO,"1,60",92,O+,azul
49,Erick Victor,52.0,08/10,Masculino,Libra,Salvador,BA,"1,68",104,B-,laranja
57,Fábio Roberto,75.0,24/12,Masculino,Capricórnio,Londrina,PR,"2,00",56,A+,amarelo

In [10]:
df_data_completa = df.query('data_nasc.str.len() == "10"')
df_data_completa.head()

,nome,idade,data_nasc,sexo,signo,cidade,estado,altura,peso,tipo_sanguineo,cor
0,Silvana Hadassa,NaN,12/06/1964,Feminino,Gêmeos,Brasília,DF,"1,67",50,A+,vermelho
1,Thales Kaique,27.0,10/12/1993,Masculino,Sagitário,Campo Grande,MS,"1,63",110,B+,laranja
2,Henry Nathan,29.0,21/09/1991,Masculino,Virgem,Macapá,AP,"1,86",106,AB-,verde
3,Lorenzo Vinicius,64.0,22/10/1956,Masculino,Libra,Contagem,MG,"1,87",100,O+,vermelho
5,Francisco Thomas,19.0,12/04/2001,Masculino,Áries,Olinda,PE,"1,91",64,AB-,preto

In [11]:
df_data_completa['ano_nasc'] = pd.to_datetime(df_data_completa['data_nasc'], format='%d/%m/%Y').dt.year

In [12]:
df_68_78 = df_data_completa.query('ano_nasc >= 1968 & ano_nasc <= 1978')
df_68_78.head()

,nome,idade,data_nasc,sexo,signo,cidade,estado,altura,peso,tipo_sanguineo,cor,ano_nasc
8,Teresinha Jaqueline,NaN,20/10/1968,Feminino,Libra,Araguaína,TO,"1,84",59,AB-,vermelho,1968
9,Manuel Luís,50.0,12/05/1970,Masculino,Touro,Manaus,AM,"1,81",85,A-,roxo,1970
10,Jorge Nicolas,NaN,11/07/1968,Masculino,Câncer,Caruaru,PE,"1,87",54,AB-,roxo,1968
13,Isabel Yasmin,50.0,22/06/1970,Feminino,Câncer,Manaus,AM,"1,64",53,AB+,azul,1970
39,Caio Ricardo,NaN,07/09/1973,Masculino,Virgem,Boa Vista,RR,"1,61",97,A-,roxo,1973

In [13]:
df_68_78.shape[0]

11

4) Ao executar o seguinte comando SQL no banco de dados criado, qual é o valor retornado?

        select count(*) from tb_pessoa inner join
        tb_tiposanguineo on tb_pessoa.id_tiposanguineo =
        tb_tiposanguineo.id inner join tb_cidade on
        tb_pessoa.id_cidade = tb_cidade.id inner join
        tb_estado on tb_cidade.id_estado = tb_estado.id where
        tb_tiposanguineo.tipo like "AB-" and (tb_estado.sigla
        like "AP" or tb_estado.sigla like "PE")

In [14]:
df_ab = df.query('tipo_sanguineo == "AB-" & (estado == "AP" | estado == "PE")')
df_ab

,nome,idade,data_nasc,sexo,signo,cidade,estado,altura,peso,tipo_sanguineo,cor
2,Henry Nathan,29.0,21/09/1991,Masculino,Virgem,Macapá,AP,"1,86",106,AB-,verde
5,Francisco Thomas,19.0,12/04/2001,Masculino,Áries,Olinda,PE,"1,91",64,AB-,preto
10,Jorge Nicolas,NaN,11/07/1968,Masculino,Câncer,Caruaru,PE,"1,87",54,AB-,roxo
25,Levi Sérgio,NaN,21/08/1949,Masculino,Leão,Santana,AP,"1,83",68,AB-,vermelho

In [15]:
df_ab.shape[0]

4

    5) Qual o nome da pessoa mais velha na base de dados?

In [16]:
pessoa_mais_velha = df.sort_values(by='idade', ascending=False).iloc[0]
pessoa_mais_velha

nome              Alice Bárbara
idade                        78
data_nasc            09/10/1942
sexo                   Feminino
signo                     Libra
cidade                 Cianorte
estado                       PR
altura                     1,78
peso                         80
tipo_sanguineo              AB+
cor                     laranja
Name: 29, dtype: object

In [17]:
pessoa_mais_velha['nome']

'Alice Bárbara'

R5: Alice Bárbara

    6) Qual o nome da pessoa mais nova da base de dados?

In [18]:
pessoa_mais_nova = df.sort_values(by='idade', ascending=True).iloc[0]
pessoa_mais_nova

nome              Francisco Thomas
idade                           19
data_nasc               12/04/2001
sexo                     Masculino
signo                        Áries
cidade                      Olinda
estado                          PE
altura                        1,91
peso                            64
tipo_sanguineo                 AB-
cor                          preto
Name: 5, dtype: object

In [19]:
pessoa_mais_nova['nome']

'Francisco Thomas'

R: Francisco Thomas

### Desenvolvimento - Parte 2

In [20]:
json_file_dir = 'videogame_sales_mongo.json'
df = pd.read_json(json_file_dir)
df.head()

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,{'$oid': '5f7a16f90a65c63ff4970b8a'},1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,{'$oid': '5f7a16f90a65c63ff4970b8b'},2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,{'$oid': '5f7a16f90a65c63ff4970b8c'},3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,{'$oid': '5f7a16f90a65c63ff4970b8d'},4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,{'$oid': '5f7a16f90a65c63ff4970b8e'},5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

    7) Qual jogo possui a maior venda global (“Global_Sales”) para a plataforma PS2?

In [21]:
df_ps2 = df.query('Platform == "PS2"')
df_ps2.sample()

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
6216,{'$oid': '5f7a16fc0a65c63ff49723d2'},6218,Mister Mosquito,PS2,2001.0,Shooter,Eidos Interactive,0.05,0.04,0.17,0.01,0.28

In [22]:
df_ps2.sort_values(by='Global_Sales', ascending=False).head(1)

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
17,{'$oid': '5f7a16f90a65c63ff4970b9b'},18,Grand Theft Auto: San Andreas,PS2,2004.0,Action,Take-Two Interactive,9.43,0.4,0.41,10.57,20.81

R: Grand Theft Auto: San Andreas

    8) Qual a posição no Rank global (“Rank”) está o segundo jogo mais vendido na Europa? Ordenar pelo atributo "EU_Sales".

In [23]:
df.sort_values(by='EU_Sales', ascending=False).head(2)

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,{'$oid': '5f7a16f90a65c63ff4970b8a'},1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,{'$oid': '5f7a16f90a65c63ff4970b8c'},3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82

In [24]:
df.sort_values(by='EU_Sales', ascending=False).iloc[1]

_id             {'$oid': '5f7a16f90a65c63ff4970b8c'}
Rank                                               3
Name                                  Mario Kart Wii
Platform                                         Wii
Year                                            2008
Genre                                         Racing
Publisher                                   Nintendo
NA_Sales                                       15.85
EU_Sales                                       12.88
JP_Sales                                        3.79
Other_Sales                                     3.31
Global_Sales                                   35.82
Name: 2, dtype: object

### Questão 9 
    
    9) Qual o nome do jogo que possui a menor venda global (“Global_Sales”) no ano de 2010?

In [36]:
query9 = ' Name == "Wand of Fortune Portable" '
query9 = query9 + '| Name == "Sakura Sakura: Haru Urara" '
query9 = query9 + '| Name == "Sora no Otoshimono: DokiDoki Summer Vacation"'
query9 = query9 + '| Name == "Wand of Fortune: Mirai e no Prologue Portable"'

In [37]:
df_gm = df.query(query9)
df_gm

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
15986,{'$oid': '5f7a17000a65c63ff49749fc'},15989,Sora no Otoshimono: DokiDoki Summer Vacation,PSP,2010.0,Adventure,Kadokawa Shoten,0.0,0.0,0.01,0.0,0.01
16004,{'$oid': '5f7a17010a65c63ff4974a0e'},16007,Wand of Fortune: Mirai e no Prologue Portable,PSP,2010.0,Adventure,Idea Factory,0.0,0.0,0.01,0.0,0.01
16021,{'$oid': '5f7a17010a65c63ff4974a1f'},16024,Wand of Fortune Portable,PSP,2010.0,Adventure,Idea Factory,0.0,0.0,0.01,0.0,0.01
16082,{'$oid': '5f7a17010a65c63ff4974a5c'},16085,Sakura Sakura: Haru Urara,PSP,2010.0,Adventure,GN Software,0.0,0.0,0.01,0.0,0.01

Alternativa

In [27]:
df_2010 = df.query('Year == 2010.0')
df_2010.sample()

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
9781,{'$oid': '5f7a16fd0a65c63ff49731bf'},9783,The God of War Trilogy,PS3,2010.0,Action,Sony Computer Entertainment,0.0,0.07,0.03,0.02,0.12

In [28]:
df_2010.sort_values(by='Global_Sales', ascending=True).iloc[0]

_id             {'$oid': '5f7a17010a65c63ff4974c5e'}
Rank                                           16599
Name                                      Know How 2
Platform                                          DS
Year                                            2010
Genre                                         Puzzle
Publisher                                   7G//AMES
NA_Sales                                           0
EU_Sales                                        0.01
JP_Sales                                           0
Other_Sales                                        0
Global_Sales                                    0.01
Name: 16596, dtype: object

    10) Qual a plataforma (“Platform”) do jogo mais vendido considerando as vendas globais ("Global_Sales ") no ano de 2008?

In [29]:
df_2008 = df.query('Year == 2008.0')
df_2008.head()

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
2,{'$oid': '5f7a16f90a65c63ff4970b8c'},3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
39,{'$oid': '5f7a16f90a65c63ff4970bb1'},40,Super Smash Bros. Brawl,Wii,2008.0,Fighting,Nintendo,6.75,2.61,2.66,1.02,13.04
51,{'$oid': '5f7a16f90a65c63ff4970bbd'},52,Grand Theft Auto IV,X360,2008.0,Action,Take-Two Interactive,6.76,3.10,0.14,1.03,11.02
56,{'$oid': '5f7a16f90a65c63ff4970bc2'},57,Grand Theft Auto IV,PS3,2008.0,Action,Take-Two Interactive,4.76,3.76,0.44,1.62,10.57
88,{'$oid': '5f7a16f90a65c63ff4970be2'},89,Pokémon Platinum Version,DS,2008.0,Role-Playing,Nintendo,2.82,1.78,2.69,0.55,7.84

In [38]:
df_2008.sort_values(by='Global_Sales', ascending=False).head(1)

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
2,{'$oid': '5f7a16f90a65c63ff4970b8c'},3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82

In [39]:
df_2008.sort_values(by='Global_Sales', ascending=False).iloc[0]

_id             {'$oid': '5f7a16f90a65c63ff4970b8c'}
Rank                                               3
Name                                  Mario Kart Wii
Platform                                         Wii
Year                                            2008
Genre                                         Racing
Publisher                                   Nintendo
NA_Sales                                       15.85
EU_Sales                                       12.88
JP_Sales                                        3.79
Other_Sales                                     3.31
Global_Sales                                   35.82
Name: 2, dtype: object

    11) Qual o nome do jogo que é exibido ao executar o comando para retornar o primeiro documento da coleção onde a condição seja a plataforma (“Platform”) igual a PS4?

In [31]:
df.query('Platform == "PS4"').head(1)

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
33,{'$oid': '5f7a16f90a65c63ff4970bab'},34,Call of Duty: Black Ops 3,PS4,2015.0,Shooter,Activision,5.77,5.81,0.35,2.31,14.24

R11: Call of Duty: Black Ops 3

    12) Quantos documentos existem na base de dados referentes à plataforma (“Platform”) “X360”?

In [32]:
plataformas = df['Platform'].value_counts()
plataformas.loc['X360']

1265

    13) Qual a plataforma (“Platform”) do jogo mais vendido no Japão ("JP_Sales") no ano de 2015?

In [41]:
df_2015 = df.query('Year == 2015.0')

In [44]:
df_2015.sort_values(by='JP_Sales', ascending=False).iloc[0]

_id             {'$oid': '5f7a16f90a65c63ff4970d28'}
Rank                                             415
Name                                Monster Hunter X
Platform                                         3DS
Year                                            2015
Genre                                         Action
Publisher                                     Capcom
NA_Sales                                        0.25
EU_Sales                                        0.19
JP_Sales                                        2.78
Other_Sales                                     0.04
Global_Sales                                    3.26
Name: 414, dtype: object

In [43]:
df_2015[df_2015['JP_Sales'] == df_2015['JP_Sales'].max()].Platform

414    3DS
Name: Platform, dtype: object

    14) Em que posição do “Rank” o jogo “The Witcher 3: Wild Hunt” está considerando a plataforma “XOne”?

In [34]:
df.query('Name == "The Witcher 3: Wild Hunt" & Platform=="XOne"')

,_id,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
1605,{'$oid': '5f7a16f90a65c63ff49711cf'},1607,The Witcher 3: Wild Hunt,XOne,2015.0,Role-Playing,Namco Bandai Games,0.66,0.47,0.0,0.11,1.24

    15) Quantos documentos são retornados ao executar uma consulta em que o atributo “Global_Sales” seja maior ou igual a 2?

In [35]:
df.query('Global_Sales > 2').shape[0]

846